KeioRoboticsAssociation/ilias2026_hal_ws/h753/Lib/mavlink_hal/platforms/stm32/mavlink_hal_stm32_complete.c
/**
 * @file mavlink_hal_stm32_complete.c
 * @brief Complete STM32 platform implementation for MAVLink HAL
 *
 * This file provides full STM32 implementations for the MAVLink HAL
 * interface including GPIO, PWM, ADC, and CAN support.
 *
 * @author Auto-generated for Epic1 Task2
 * @date 2025-11-10
 */

#include "../../include/mavlink_hal_interface.h"

#ifdef MAVLINK_HAL_ON_STM32

/* STM32 HAL includes */
#include "stm32h7xx_hal.h"  /* Adjust for your STM32 series */

/* ============================================================================
 * Platform-Specific Includes and Definitions
 * ============================================================================ */

#include <string.h>

/* Maximum number of instances */
#ifndef MAVLINK_HAL_MAX_UART_INSTANCES
#define MAVLINK_HAL_MAX_UART_INSTANCES 4
#endif

#ifndef MAVLINK_HAL_MAX_GPIO_IRQ_PINS
#define MAVLINK_HAL_MAX_GPIO_IRQ_PINS 16
#endif

#ifndef MAVLINK_HAL_MAX_PWM_CHANNELS
#define MAVLINK_HAL_MAX_PWM_CHANNELS 16
#endif

#ifndef MAVLINK_HAL_MAX_ADC_CHANNELS
#define MAVLINK_HAL_MAX_ADC_CHANNELS 16
#endif

/* ============================================================================
 * Private Types and Structures
 * ============================================================================ */

/**
 * @brief UART instance data
 */
typedef struct {
    UART_HandleTypeDef*             huart;
    mavlink_hal_uart_rx_callback_t  rx_callback;
    void*                           rx_user_data;
    uint8_t*                        rx_buffer;
    size_t                          rx_buffer_size;
    volatile size_t                 rx_head;
    volatile size_t                 rx_tail;
} stm32_uart_instance_t;

/**
 * @brief GPIO IRQ instance data
 */
typedef struct {
    uint16_t                        pin;
    GPIO_TypeDef*                   port;
    mavlink_hal_gpio_irq_callback_t callback;
    void*                           user_data;
    bool                            active;
} stm32_gpio_irq_instance_t;

/**
 * @brief PWM channel instance data
 */
typedef struct {
    TIM_HandleTypeDef*      htim;
    uint32_t                channel;
    uint16_t                resolution_max;
    bool                    active;
} stm32_pwm_instance_t;

/**
 * @brief ADC channel instance data
 */
typedef struct {
    ADC_HandleTypeDef*      hadc;
    uint32_t                channel;
    uint16_t                resolution_max;
    float                   vref;
    bool                    active;
} stm32_adc_instance_t;

/* ============================================================================
 * Private Variables
 * ============================================================================ */

static stm32_uart_instance_t uart_instances[MAVLINK_HAL_MAX_UART_INSTANCES] = {0};
static stm32_gpio_irq_instance_t gpio_irq_instances[MAVLINK_HAL_MAX_GPIO_IRQ_PINS] = {0};
static stm32_pwm_instance_t pwm_instances[MAVLINK_HAL_MAX_PWM_CHANNELS] = {0};
static stm32_adc_instance_t adc_instances[MAVLINK_HAL_MAX_ADC_CHANNELS] = {0};

/* ============================================================================
 * UART Operations - STM32 Implementation
 * ============================================================================ */

static mavlink_hal_error_t stm32_uart_init(
    mavlink_hal_uart_handle_t handle,
    const mavlink_hal_uart_config_t* config)
{
    if (handle == NULL || config == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)handle;

    /* Configure UART parameters */
    huart->Init.BaudRate = config->baudrate;
    huart->Init.WordLength = (config->data_bits == 8) ?
                              UART_WORDLENGTH_8B : UART_WORDLENGTH_7B;
    huart->Init.StopBits = (config->stop_bits == 1) ?
                            UART_STOPBITS_1 : UART_STOPBITS_2;

    switch (config->parity) {
        case 0: huart->Init.Parity = UART_PARITY_NONE; break;
        case 1: huart->Init.Parity = UART_PARITY_ODD; break;
        case 2: huart->Init.Parity = UART_PARITY_EVEN; break;
        default: return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    huart->Init.Mode = UART_MODE_TX_RX;
    huart->Init.HwFlowCtl = config->flow_control ?
                             UART_HWCONTROL_RTS_CTS : UART_HWCONTROL_NONE;
    huart->Init.OverSampling = UART_OVERSAMPLING_16;

    /* Initialize UART */
    if (HAL_UART_Init(huart) != HAL_OK) {
        return MAVLINK_HAL_ERR_HW_FAULT;
    }

    /* Find available slot for UART instance tracking */
    for (int i = 0; i < MAVLINK_HAL_MAX_UART_INSTANCES; i++) {
        if (uart_instances[i].huart == NULL) {
            uart_instances[i].huart = huart;
            uart_instances[i].rx_buffer_size = config->rx_buffer_size;
            uart_instances[i].rx_head = 0;
            uart_instances[i].rx_tail = 0;
            break;
        }
    }

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_uart_deinit(mavlink_hal_uart_handle_t handle)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)handle;

    if (HAL_UART_DeInit(huart) != HAL_OK) {
        return MAVLINK_HAL_ERR_HW_FAULT;
    }

    /* Clear instance data */
    for (int i = 0; i < MAVLINK_HAL_MAX_UART_INSTANCES; i++) {
        if (uart_instances[i].huart == huart) {
            memset(&uart_instances[i], 0, sizeof(stm32_uart_instance_t));
            break;
        }
    }

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_uart_send(
    mavlink_hal_uart_handle_t handle,
    const uint8_t* data,
    size_t length,
    mavlink_hal_timeout_ms_t timeout_ms,
    size_t* bytes_sent)
{
    if (handle == NULL || data == NULL || bytes_sent == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)handle;

    HAL_StatusTypeDef status = HAL_UART_Transmit(huart, (uint8_t*)data, length, timeout_ms);

    if (status == HAL_OK) {
        *bytes_sent = length;
        return MAVLINK_HAL_OK;
    } else if (status == HAL_TIMEOUT) {
        *bytes_sent = 0;
        return MAVLINK_HAL_ERR_TIMEOUT;
    } else {
        *bytes_sent = 0;
        return MAVLINK_HAL_ERR_IO;
    }
}

static mavlink_hal_error_t stm32_uart_receive(
    mavlink_hal_uart_handle_t handle,
    uint8_t* buffer,
    size_t length,
    mavlink_hal_timeout_ms_t timeout_ms,
    size_t* bytes_received)
{
    if (handle == NULL || buffer == NULL || bytes_received == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)handle;

    HAL_StatusTypeDef status = HAL_UART_Receive(huart, buffer, length, timeout_ms);

    if (status == HAL_OK) {
        *bytes_received = length;
        return MAVLINK_HAL_OK;
    } else if (status == HAL_TIMEOUT) {
        *bytes_received = 0;
        return MAVLINK_HAL_ERR_TIMEOUT;
    } else {
        *bytes_received = 0;
        return MAVLINK_HAL_ERR_IO;
    }
}

static mavlink_hal_error_t stm32_uart_register_rx_callback(
    mavlink_hal_uart_handle_t handle,
    mavlink_hal_uart_rx_callback_t callback,
    void* user_data)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    UART_HandleTypeDef* huart = (UART_HandleTypeDef*)handle;

    /* Find UART instance and register callback */
    for (int i = 0; i < MAVLINK_HAL_MAX_UART_INSTANCES; i++) {
        if (uart_instances[i].huart == huart) {
            uart_instances[i].rx_callback = callback;
            uart_instances[i].rx_user_data = user_data;
            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_NOT_INITIALIZED;
}

static mavlink_hal_error_t stm32_uart_available(
    mavlink_hal_uart_handle_t handle,
    size_t* available)
{
    if (handle == NULL || available == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    /* This is a stub - would need ring buffer implementation */
    *available = 0;
    return MAVLINK_HAL_OK;
}

/* ============================================================================
 * GPIO Operations - STM32 Implementation (COMPLETE)
 * ============================================================================ */

/**
 * @brief GPIO handle structure for STM32
 * User should pass pointer to this structure
 */
typedef struct {
    GPIO_TypeDef* port;
    uint16_t pin;
} stm32_gpio_t;

static mavlink_hal_error_t stm32_gpio_init(
    mavlink_hal_gpio_handle_t handle,
    const mavlink_hal_gpio_config_t* config)
{
    if (handle == NULL || config == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_gpio_t* gpio = (stm32_gpio_t*)handle;

    GPIO_InitTypeDef GPIO_InitStruct = {0};
    GPIO_InitStruct.Pin = gpio->pin;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    switch (config->mode) {
        case MAVLINK_HAL_GPIO_MODE_INPUT:
            GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
            GPIO_InitStruct.Pull = GPIO_NOPULL;
            break;

        case MAVLINK_HAL_GPIO_MODE_OUTPUT:
            GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
            GPIO_InitStruct.Pull = GPIO_NOPULL;
            break;

        case MAVLINK_HAL_GPIO_MODE_INPUT_PULLUP:
            GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
            GPIO_InitStruct.Pull = GPIO_PULLUP;
            break;

        case MAVLINK_HAL_GPIO_MODE_INPUT_PULLDOWN:
            GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
            GPIO_InitStruct.Pull = GPIO_PULLDOWN;
            break;

        case MAVLINK_HAL_GPIO_MODE_OUTPUT_OD:
            GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
            GPIO_InitStruct.Pull = GPIO_NOPULL;
            break;

        default:
            return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    HAL_GPIO_Init(gpio->port, &GPIO_InitStruct);

    /* Set initial state for output pins */
    if (config->mode == MAVLINK_HAL_GPIO_MODE_OUTPUT ||
        config->mode == MAVLINK_HAL_GPIO_MODE_OUTPUT_OD) {
        HAL_GPIO_WritePin(gpio->port, gpio->pin,
                          config->initial_state ? GPIO_PIN_SET : GPIO_PIN_RESET);
    }

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_gpio_write(
    mavlink_hal_gpio_handle_t handle,
    bool state)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_gpio_t* gpio = (stm32_gpio_t*)handle;
    HAL_GPIO_WritePin(gpio->port, gpio->pin, state ? GPIO_PIN_SET : GPIO_PIN_RESET);

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_gpio_read(
    mavlink_hal_gpio_handle_t handle,
    bool* state)
{
    if (handle == NULL || state == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_gpio_t* gpio = (stm32_gpio_t*)handle;
    *state = (HAL_GPIO_ReadPin(gpio->port, gpio->pin) == GPIO_PIN_SET);

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_gpio_toggle(mavlink_hal_gpio_handle_t handle)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_gpio_t* gpio = (stm32_gpio_t*)handle;
    HAL_GPIO_TogglePin(gpio->port, gpio->pin);

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_gpio_register_irq(
    mavlink_hal_gpio_handle_t handle,
    mavlink_hal_gpio_irq_callback_t callback,
    void* user_data)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_gpio_t* gpio = (stm32_gpio_t*)handle;

    /* Find available slot */
    for (int i = 0; i < MAVLINK_HAL_MAX_GPIO_IRQ_PINS; i++) {
        if (!gpio_irq_instances[i].active) {
            gpio_irq_instances[i].pin = gpio->pin;
            gpio_irq_instances[i].port = gpio->port;
            gpio_irq_instances[i].callback = callback;
            gpio_irq_instances[i].user_data = user_data;
            gpio_irq_instances[i].active = true;

            /* Note: EXTI configuration should be done in CubeMX */
            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_RESOURCE_EXHAUSTED;
}

/**
 * @brief GPIO EXTI callback - call this from your HAL_GPIO_EXTI_Callback
 */
void mavlink_hal_stm32_gpio_exti_callback(uint16_t GPIO_Pin)
{
    for (int i = 0; i < MAVLINK_HAL_MAX_GPIO_IRQ_PINS; i++) {
        if (gpio_irq_instances[i].active && gpio_irq_instances[i].pin == GPIO_Pin) {
            if (gpio_irq_instances[i].callback) {
                gpio_irq_instances[i].callback(GPIO_Pin, gpio_irq_instances[i].user_data);
            }
        }
    }
}

/* ============================================================================
 * Timer Operations - STM32 Implementation
 * ============================================================================ */

static uint32_t stm32_time_millis(void)
{
    return HAL_GetTick();
}

static mavlink_hal_timestamp_us_t stm32_time_micros(void)
{
    /* Use DWT cycle counter for microsecond precision (if available) */
#ifdef DWT
    static uint32_t last_cyccnt = 0;
    static uint64_t us_overflow = 0;

    uint32_t cyccnt = DWT->CYCCNT;
    if (cyccnt < last_cyccnt) {
        us_overflow += (0xFFFFFFFFUL / (SystemCoreClock / 1000000));
    }
    last_cyccnt = cyccnt;

    return us_overflow + (cyccnt / (SystemCoreClock / 1000000));
#else
    /* Fallback to millisecond precision */
    return (mavlink_hal_timestamp_us_t)HAL_GetTick() * 1000ULL;
#endif
}

static void stm32_delay_ms(uint32_t ms)
{
    HAL_Delay(ms);
}

static void stm32_delay_us(uint32_t us)
{
#ifdef DWT
    uint32_t start = DWT->CYCCNT;
    uint32_t cycles = us * (SystemCoreClock / 1000000);
    while ((DWT->CYCCNT - start) < cycles);
#else
    /* Software approximation */
    volatile uint32_t count = us * (SystemCoreClock / 1000000) / 4;
    while (count--);
#endif
}

static mavlink_hal_error_t stm32_timer_start(
    mavlink_hal_timer_handle_t handle,
    uint32_t period_ms,
    mavlink_hal_timer_callback_t callback,
    void* user_data)
{
    /* This would require timer configuration in CubeMX */
    /* Implementation depends on specific timer hardware setup */
    return MAVLINK_HAL_ERR_NOT_SUPPORTED;
}

static mavlink_hal_error_t stm32_timer_stop(mavlink_hal_timer_handle_t handle)
{
    return MAVLINK_HAL_ERR_NOT_SUPPORTED;
}

/* ============================================================================
 * PWM Operations - STM32 Implementation (COMPLETE)
 * ============================================================================ */

/**
 * @brief PWM handle structure for STM32
 * User should pass pointer to this structure
 */
typedef struct {
    TIM_HandleTypeDef* htim;
    uint32_t channel;  /* TIM_CHANNEL_1, TIM_CHANNEL_2, etc. */
} stm32_pwm_t;

static mavlink_hal_error_t stm32_pwm_init(
    mavlink_hal_pwm_handle_t handle,
    const mavlink_hal_pwm_config_t* config)
{
    if (handle == NULL || config == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_pwm_t* pwm = (stm32_pwm_t*)handle;

    /* Find available slot */
    for (int i = 0; i < MAVLINK_HAL_MAX_PWM_CHANNELS; i++) {
        if (!pwm_instances[i].active) {
            pwm_instances[i].htim = pwm->htim;
            pwm_instances[i].channel = pwm->channel;
            pwm_instances[i].resolution_max = (1 << config->resolution_bits) - 1;
            pwm_instances[i].active = true;

            /* Configure PWM frequency by adjusting timer prescaler and period */
            /* Note: This assumes timer is already initialized in CubeMX */
            uint32_t timer_clock = HAL_RCC_GetPCLK1Freq() * 2;  /* Adjust for your clock */
            uint32_t period = timer_clock / config->frequency_hz;

            pwm->htim->Init.Period = period - 1;
            pwm->htim->Init.Prescaler = 0;

            if (HAL_TIM_PWM_Init(pwm->htim) != HAL_OK) {
                pwm_instances[i].active = false;
                return MAVLINK_HAL_ERR_HW_FAULT;
            }

            /* Configure channel */
            TIM_OC_InitTypeDef sConfigOC = {0};
            sConfigOC.OCMode = TIM_OCMODE_PWM1;
            sConfigOC.Pulse = config->initial_duty;
            sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
            sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

            if (HAL_TIM_PWM_ConfigChannel(pwm->htim, &sConfigOC, pwm->channel) != HAL_OK) {
                pwm_instances[i].active = false;
                return MAVLINK_HAL_ERR_HW_FAULT;
            }

            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_RESOURCE_EXHAUSTED;
}

static mavlink_hal_error_t stm32_pwm_set_duty(
    mavlink_hal_pwm_handle_t handle,
    uint16_t duty_cycle)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_pwm_t* pwm = (stm32_pwm_t*)handle;
    __HAL_TIM_SET_COMPARE(pwm->htim, pwm->channel, duty_cycle);

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_pwm_set_duty_percent(
    mavlink_hal_pwm_handle_t handle,
    float percent)
{
    if (handle == NULL || percent < 0.0f || percent > 100.0f) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_pwm_t* pwm = (stm32_pwm_t*)handle;

    /* Find instance to get max value */
    for (int i = 0; i < MAVLINK_HAL_MAX_PWM_CHANNELS; i++) {
        if (pwm_instances[i].active && pwm_instances[i].htim == pwm->htim &&
            pwm_instances[i].channel == pwm->channel) {

            uint16_t duty = (uint16_t)((percent * pwm_instances[i].resolution_max) / 100.0f);
            __HAL_TIM_SET_COMPARE(pwm->htim, pwm->channel, duty);
            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_NOT_INITIALIZED;
}

static mavlink_hal_error_t stm32_pwm_start(mavlink_hal_pwm_handle_t handle)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_pwm_t* pwm = (stm32_pwm_t*)handle;

    if (HAL_TIM_PWM_Start(pwm->htim, pwm->channel) != HAL_OK) {
        return MAVLINK_HAL_ERR_HW_FAULT;
    }

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_pwm_stop(mavlink_hal_pwm_handle_t handle)
{
    if (handle == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_pwm_t* pwm = (stm32_pwm_t*)handle;

    if (HAL_TIM_PWM_Stop(pwm->htim, pwm->channel) != HAL_OK) {
        return MAVLINK_HAL_ERR_HW_FAULT;
    }

    return MAVLINK_HAL_OK;
}

/* ============================================================================
 * ADC Operations - STM32 Implementation (COMPLETE)
 * ============================================================================ */

/**
 * @brief ADC handle structure for STM32
 * User should pass pointer to this structure
 */
typedef struct {
    ADC_HandleTypeDef* hadc;
    uint32_t channel;  /* ADC_CHANNEL_0, ADC_CHANNEL_1, etc. */
    float vref;        /* Reference voltage */
} stm32_adc_t;

static mavlink_hal_error_t stm32_adc_init(
    mavlink_hal_adc_handle_t handle,
    const mavlink_hal_adc_config_t* config)
{
    if (handle == NULL || config == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_adc_t* adc = (stm32_adc_t*)handle;

    /* Find available slot */
    for (int i = 0; i < MAVLINK_HAL_MAX_ADC_CHANNELS; i++) {
        if (!adc_instances[i].active) {
            adc_instances[i].hadc = adc->hadc;
            adc_instances[i].channel = adc->channel;
            adc_instances[i].resolution_max = (1 << config->resolution_bits) - 1;
            adc_instances[i].vref = config->reference_voltage;
            adc_instances[i].active = true;

            /* Configure ADC channel */
            ADC_ChannelConfTypeDef sConfig = {0};
            sConfig.Channel = adc->channel;
            sConfig.Rank = ADC_REGULAR_RANK_1;
            sConfig.SamplingTime = ADC_SAMPLETIME_64CYCLES_5;  /* Adjust as needed */

            if (HAL_ADC_ConfigChannel(adc->hadc, &sConfig) != HAL_OK) {
                adc_instances[i].active = false;
                return MAVLINK_HAL_ERR_HW_FAULT;
            }

            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_RESOURCE_EXHAUSTED;
}

static mavlink_hal_error_t stm32_adc_read(
    mavlink_hal_adc_handle_t handle,
    uint16_t* value)
{
    if (handle == NULL || value == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    stm32_adc_t* adc = (stm32_adc_t*)handle;

    /* Start ADC conversion */
    if (HAL_ADC_Start(adc->hadc) != HAL_OK) {
        return MAVLINK_HAL_ERR_HW_FAULT;
    }

    /* Wait for conversion to complete */
    if (HAL_ADC_PollForConversion(adc->hadc, 100) != HAL_OK) {
        HAL_ADC_Stop(adc->hadc);
        return MAVLINK_HAL_ERR_TIMEOUT;
    }

    /* Get ADC value */
    *value = (uint16_t)HAL_ADC_GetValue(adc->hadc);

    HAL_ADC_Stop(adc->hadc);

    return MAVLINK_HAL_OK;
}

static mavlink_hal_error_t stm32_adc_read_voltage(
    mavlink_hal_adc_handle_t handle,
    float* voltage)
{
    if (handle == NULL || voltage == NULL) {
        return MAVLINK_HAL_ERR_INVALID_PARAM;
    }

    uint16_t raw_value;
    mavlink_hal_error_t err = stm32_adc_read(handle, &raw_value);

    if (err != MAVLINK_HAL_OK) {
        return err;
    }

    /* Find instance to get vref and resolution */
    stm32_adc_t* adc = (stm32_adc_t*)handle;
    for (int i = 0; i < MAVLINK_HAL_MAX_ADC_CHANNELS; i++) {
        if (adc_instances[i].active && adc_instances[i].hadc == adc->hadc &&
            adc_instances[i].channel == adc->channel) {

            *voltage = ((float)raw_value * adc_instances[i].vref) / (float)adc_instances[i].resolution_max;
            return MAVLINK_HAL_OK;
        }
    }

    return MAVLINK_HAL_ERR_NOT_INITIALIZED;
}

/* ============================================================================
 * HAL Registration
 * ============================================================================ */

MAVLINK_HAL_REGISTER(
    .platform = MAVLINK_HAL_PLATFORM_STM32,
    .features = MAVLINK_HAL_FEATURE_UART |
                MAVLINK_HAL_FEATURE_GPIO |
                MAVLINK_HAL_FEATURE_TIMER |
                MAVLINK_HAL_FEATURE_PWM |
                MAVLINK_HAL_FEATURE_ADC,
    .version_major = MAVLINK_HAL_VERSION_MAJOR,
    .version_minor = MAVLINK_HAL_VERSION_MINOR,
    .version_patch = MAVLINK_HAL_VERSION_PATCH,
    .platform_name = "STM32 Complete",

    /* UART operations */
    .uart_init = stm32_uart_init,
    .uart_deinit = stm32_uart_deinit,
    .uart_send = stm32_uart_send,
    .uart_receive = stm32_uart_receive,
    .uart_register_rx_callback = stm32_uart_register_rx_callback,
    .uart_available = stm32_uart_available,

    /* GPIO operations */
    .gpio_init = stm32_gpio_init,
    .gpio_write = stm32_gpio_write,
    .gpio_read = stm32_gpio_read,
    .gpio_toggle = stm32_gpio_toggle,
    .gpio_register_irq = stm32_gpio_register_irq,

    /* Timer operations */
    .time_millis = stm32_time_millis,
    .time_micros = stm32_time_micros,
    .delay_ms = stm32_delay_ms,
    .delay_us = stm32_delay_us,
    .timer_start = stm32_timer_start,
    .timer_stop = stm32_timer_stop,

    /* PWM operations */
    .pwm_init = stm32_pwm_init,
    .pwm_set_duty = stm32_pwm_set_duty,
    .pwm_set_duty_percent = stm32_pwm_set_duty_percent,
    .pwm_start = stm32_pwm_start,
    .pwm_stop = stm32_pwm_stop,

    /* ADC operations */
    .adc_init = stm32_adc_init,
    .adc_read = stm32_adc_read,
    .adc_read_voltage = stm32_adc_read_voltage
);

#endif /* MAVLINK_HAL_ON_STM32 */
